driver-tests/httpsoapbc/AttributeTest/TestAttrCA/test/TestCase2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:num="http://j2ee.netbeans.org/wsdl/BpelModule2/NumberService">
  <soapenv:Body>
    <num:NumRequest>
      <nString>hello world</nString>
    </num:NumRequest>
  </soapenv:Body>
</soapenv:Envelope>